/*
Опишите класс животного, живущего в зоопарке, на основе следующего описания:
Животное в зоопарке описывается на основе следующих параметров:
    Общее описание животного:
        Имя (Петя, Симба, Матильда)
        Возраст (5, 1, 20)
        Название вида (Слон, Пингвин, Тигр)
        Необходимый биом (Тропики, Тундра, Пустыня)
        Необходимая площадь на особь (10 м^2)
        Что кушает (Рыба, Мясо, Сено) - Один тип животного может питаться несколькими продуктами
        Издаваемый звук (Ауф, Хрю, Рррр)
    Функционал животного (достаточно условно обозначить действие выводом в консоль):
        Есть
        Издать звук
        Играть
*/

/*
Внесите следующие изменения в класс животного из прошлого блока:
-Правильно опишите все модификаторы доступа к свойствам и полям класса
-Добавьте конструктор для создания конкретного животного
-Измените метод еды таким образом, чтобы оно могло есть только подходящую еду
*/

using System.Xml.Linq;
using HomeworkClass;

Animal[] animals = new Animal[]
{
    new Animal ("Слон", "Петя", "рыба", "ауф"),
    new Animal ("Пингвин", "Симба", "мясо", "хрю"),
    new Animal ("Тигр", "Матильда", "сено", "рррр")
};

for (int i = 0; i < animals.Length; i++)
{
    animals[i].Eat();
    animals[i].MakeASound();
    animals[i].Play();
}
    
Console.ReadKey();
